Hyper-TH/STM32/realm.c

/*
Copyright (C) 2014  Frank Duignan

This program is free software; you can redistribute it and/or
modify it under the terms of the GNU General Public License
as published by the Free Software Foundation; either version 2
of the License, or (at your option) any later version.

This program is distributed in the hope that it will be useful,
but WITHOUT ANY WARRANTY; without even the implied warranty of
MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
GNU General Public License for more details.

You should have received a copy of the GNU General Public License
along with this program; if not, write to the Free Software
Foundation, Inc., 51 Franklin Street, Fifth Floor, Boston, MA  02110-1301, USA.
*/

#include <stdint.h>
#include <stm32l031xx.h>
#include "stm32l031lib.h"

// Find types: h(ealth),s(trength),m(agic),g(old),w(eapon)
static const char FindTypes[]={'h','s','m','g','w'};

// The following arrays define the bad guys and 
// their battle properies - ordering matters!
// Baddie types : O(gre),T(roll),D(ragon),H(ag)
static const char Baddies[]={'O','T','D','H'};
// The following is 4 sets of 4 damage types
static const byte WeaponDamage[]={10,10,5,25,10,10,5,25,10,15,5,15,5,5,2,10};
#define ICE_SPELL_COST 10
#define FIRE_SPELL_COST 20
#define LIGHTNING_SPELL_COST 30
static const byte FreezeSpellDamage[]={10,20,5,0};
static const byte FireSpellDamage[]={20,10,5,0};
static const byte LightningSpellDamage[]={15,10,25,0};
static const byte BadGuyDamage[]={10,10,15,5};
static int GameStarted = 0;
static tPlayer thePlayer;
static tRealm theRealm;
void randomize(void);
void ADCBegin(void);
uint16_t ADCRead(void);

/* START OF MUSIC CONFIG */
#define CPU_FREQ 16000000

// structure for music notes arrays
typedef struct {
	uint32_t frequency;
	uint32_t duration;
	uint32_t wait;
} note;

void playNote(note *n);
void playTune(const note *n, int notecount, int repeat);
void SysTick_Handler(void);
void delayms(uint32_t dly);
void stopSound(void);

static volatile uint32_t SoundDuration = 0;
static volatile uint32_t ms_counter = 0;
static const note *Tune;
static volatile int TuneNoteCount=0;
static volatile int TuneLoop = 0;
//static volatile uint32_t blink_period = 0;

/*START OF NOTES*/
#define B2 124

#define A3 220
#define As3 233
#define B3 247
#define C3 130
#define D3 147
#define E3 165
#define F3 175
#define Fs3 185
#define G3 196

#define A4 440
#define As4 466
#define B4 494
#define C4 262
#define Cs4 277
#define D4 294
#define Ds4 311
#define E4 329
#define F4 349
#define Fs4 370
#define G4 392
#define Gs4 415
#define A5 880

#define As5 932
#define B5 988
#define C5 523
#define Cs5 554
#define D5 587
#define Ds5 622
#define E5 659
#define F5 698
#define Fs5 740
#define G5 784
#define Gs5 831

#define C6 1047
#define Cs6 1109
#define D6 1175
#define Ds6 1245
#define E6 1319
#define F6 1397
#define Fs6 1480
#define G6 1568

#define C7 2093
#define C8 4186
/*END OF NOTES*/

/*START OF MUSIC ARRAYS*/
static const note testNote[] = { {C4,1,0} };

// Startup sound effect (GameBoy startup)
static const note startUp[] = {
	{As4,50,0}, {F5,50,0}, {A5,50,0}, {C6,50,0}, {D6,50,0}, {E6,50,0}, {G6,800,0},
	{C7,50,0}, {C8,800,0}
};

static const note rock[] = { {C4,50,0} };
// Lightning Effect (Originally composed)
static const note light[] = {
	{C5,77,0}, {E5,77,0}, {G5,77,0},
};

// Fire Effect (Originally composed)
static const note fire[] = {
	{A3,77,0}, {C4,77,0}, {E4,77,0},
};

// Ice Effect (Originally composed)
static const note ice[] = {
	{C6,77,0}, {E5,77,0}, {G5,77,0},
};

// Punch Effect (Originally composed)
static const note punch[] = {
	{C5,77,0}, {E5,77,0}, 
};

// Sword Effect (Originally composed)
static const note sword[] = {
	{C4,100,0}, {G4,77,0}, 
};

// BG music for baddies (Champion Lance/Trainer Red Pokemon GSC)
static const note baddies[] = { 
	//1st page
	//B1-7
	{Ds4,306,306}, {Ds4,306,306}, //1
	{Ds4,306,306}, {Ds4,306,0}, {D4,306,0}, //2
	{Ds4,153,10}, {Ds4,153,306}, {Ds4,153,10}, {Ds4,153,306}, //3
	{Ds4,153,10}, {Ds4,153,306}, {Ds4,153,10}, {Ds4,153,0}, {As4,306,0}, //4
	{Ds4,153,10}, {Ds4,153,306}, {Ds4,153,10}, {Ds4,153,306}, //5
	{Ds4,153,10}, {Ds4,153,306}, {Ds4,153,10}, {Ds4,153,0}, {B4,306,0}, //6
	{Ds4,153,10}, {Ds4,153,306}, {Ds4,153,10}, {Ds4,153,306}, //7

	//B8-14
	{Ds4,153,10}, {Ds4,153,306}, {Ds4,153,10}, {Ds4,153,0}, {Cs5,306,0}, //8
	{Ds4,153,10}, {Ds4,153,0}, {As4,306,0}, {Ds4,153,10}, {Ds4,153,0}, {B4,306,0}, //9
	{Ds4,153,10}, {Ds4,153,0}, {As4,306,0}, {Ds4,153,10}, {Ds4,153,0}, {D4,306,0}, //10
	{Ds4,153,10}, {Ds4,153,0}, {As4,306,0}, {Ds4,153,10}, {Ds4,153,0}, {B4,306,0}, //11
	{Ds4,153,10}, {Ds4,153,0}, {As4,306,0}, {Ds4,153,10}, {Ds4,153,0}, {F4,306,0}, //12
	{Ds4,153,10}, {Ds4,153,0}, {As4,306,0}, {Ds4,153,10}, {Ds4,153,0}, {B4,306,0}, //13
	{Ds4,153,10}, {Ds4,153,0}, {As4,306,0}, {Ds4,153,10}, {Ds4,153,0}, {D4,306,0}, //14

	//B15-19
	{Ds4,153,10}, {Ds4,153,0}, {As4,306,0}, {Ds4,153,10}, {Ds4,153,0}, {B4,306,0}, //15
	{Ds4,153,10}, {Ds4,153,0}, {C5,306,0}, {Ds4,153,10}, {Ds4,153,0}, {Cs5,306,0}, //16
	{Ds5,612,0}, {Ds4,612,0}, //17
	{E5,765,0}, {As4,77,0}, {B4,77,0}, {C5,77,0}, {Cs5,77,0}, //18
	{Ds5,459,0}, {As4,306,153}, {D5,153,0}, {Ds5,153,0}, //19

	//B20-23
	{Cs5,306,0}, {C5,306,0}, {B4,306,0}, {As4,306,0}, //20
	{B4,612,0}, {E5,612,0}, //21
	{Gs4,153,10}, {Gs4,153,0}, {B4,306,0}, {Gs4,153,10}, {Gs4,153,0}, {Cs5,306,0}, //22
	{Ds5,459,0}, {As4,306,153}, {D5,153,0}, {Ds5,153,0}, //23

	//B24-27
	{Cs5,306,0}, {C5,306,0}, {B4,306,0}, {As4,153,0}, {B4,153,0}, //24
	{E5,612,0}, {Gs5,612,0}, //25 
	{E5,612,0}, {B5,612,0}, //26
	{Ds5,153,10}, {Ds5,153,153}, {Ds5,153,153}, {Ds5,153,153}, {Ds5,153,153}, //27

	//2nd page
	//B28-32
	{Ds5,153,153}, {Ds5,153,0}, {E5,306,10}, {E5,306,0}, //28
	{Ds5,153,10}, {Ds5,153,153}, {Ds5,153,153}, {Ds5,153,153}, {Ds5,153,153}, //29
	{Ds5,153,153}, {Ds5,153,0}, {Fs5,306,10}, {Fs5,306,0}, //30
	{Ds5,612,0}, {Ds4,612,0}, //31
	{Cs5,612,0}, {Cs4,612,0}, //32

	//B33-36
	{Ds4,1224,10}, //33
	{Ds4,1224,0}, //34
	{F4,1224,0}, //35
	{Fs4,1224,0}, //36

	//B37-41
	{Ds6,306,0}, {D6,306,0}, {Cs6,306,0}, {C6,306,0}, //37
	{Ds6,153,10}, {D6,153,0}, {Cs6,153,10}, {C6,153,0}, {B5,306,10}, {B5,306,0}, //38
	{Ds6,306,0}, {D6,306,0}, {Cs6,306,0}, {C6,306,0}, //39
	{Ds6,153,10}, {D6,153,0}, {Cs6,153,10}, {C6,153,0}, {B5,306,10}, {B5,306,0}, //40
	{Ds4,1224,0}, //41

	//B42-45
	{B4,1224,0}, //42
	{As4,1224,0}, //43
	{Gs4,1224,0}, //44
	{Ds4,153,10}, {Ds4,153,0}, {As4,306,0}, {Ds4,153,10}, {Ds4,153,0}, {B4,306,0}, //45

	//B46-49
	{Ds4,153,10}, {Ds4,153,0}, {As4,306,0}, {Ds4,153,10}, {Ds4,153,0}, {A4,306,0}, //46
	{Ds4,153,10}, {Ds4,153,0}, {As4,306,0}, {Ds4,153,10}, {Ds4,153,0}, {B4,306,0}, //47
	{Ds4,153,10}, {Ds4,153,0}, {Cs5,306,0}, {Ds4,153,10}, {Ds4,153,0}, {D5,306,0}, //48
	{Ds5,306,0}, {As4,306,0}, {E5,306,0}, {B4,306,0}, //49

	//3rd page
	//B50-52
	{Fs5,306,0}, {Cs5,306,0}, {E5,306,0}, {B4,306,0}, //50
	{Ds5,306,0}, {As4,306,0}, {E5,306,0}, {B4,306,0}, //51
	{Fs5,306,0}, {Cs5,306,0}, {Gs5,306,0}, {D5,306,0} //52
};


// BG music in general (Viridian Forest Pokemon RGB)
static const note cave[] = {
	//1st page
	//B1-5
	{E5,250,250}, {E5,250,250}, {E5,250,250}, {E5,250,250},//5

	//B6-9
	{As5,250,250}, {As5,250,250}, {As5,250,250}, {As5,250,250}, //6
	{E5,250,250}, {E5,250,250}, {E5,250,250}, {E5,250,250}, //7
	{Cs6,250,250}, {Cs6,250,250}, {Cs6,250,250}, {Cs6,250,250}, //8
	{B4,250,250}, {B4,250,250}, {B4,250,250}, {B4,250,250}, //9

	//B10-12
	{Fs5,250,250}, {Fs5,250,250}, {Fs5,250,250}, {Fs5,250,250}, //10
	{G3,250,0}, {As3,250,250}, {G3,250,0}, {Cs4,250,250}, {G3,250,0}, {As3,250,10}, //11
	{As3,250,0}, {G3,250,0}, {Cs4,250,250}, {G3,250,0}, {A3,250,250}, {Fs3,250,0}, //12


