Hyper-TH/STM32/realm.c
	//START REPEAT
	//B1-5
	{E5,250,250}, {E5,250,250}, {E5,250,250}, {E5,250,250},//5

	//B6-9
	{As5,250,250}, {As5,250,250}, {As5,250,250}, {As5,250,250}, //6
	{E5,250,250}, {E5,250,250}, {E5,250,250}, {E5,250,250}, //7
	{Cs6,250,250}, {Cs6,250,250}, {Cs6,250,250}, {Cs6,250,250}, //8
	{B4,250,250}, {B4,250,250}, {B4,250,250}, {B4,250,250}, //9

	//B10-12
	{Fs5,250,250}, {Fs5,250,250}, {Fs5,250,250}, {Fs5,250,250}, //10
	{G3,250,0}, {As3,250,250}, {G3,250,0}, {Cs4,250,250}, {G3,250,0}, {As3,250,10}, //11
	{As3,250,0}, {G3,250,0}, {Cs4,250,250}, {G3,250,0}, {A3,250,250}, {Fs3,250,0}, //12
	//END REPEAT

	//B13-16
	{E4,250,0}, {G4,250,0}, {E4,250,0}, {Ds4,250,0}, {E4,250,10}, {E4,250,0}, {E6,250,250}, //13
	{Ds6,250,250}, {D6,250,250}, {Cs6,250,0}, {C6,250,0}, {E5,250,0}, {G5,250,0}, //14
	{As4,250,0}, {Cs4,250,0}, {As4,250,0}, {A4,250,0}, {As4,250,0}, {G4,250,0}, {G6,250,250}, //15
	{Fs6,250,250}, {F6,250,250}, {E6,250,0}, {Ds6,250,0}, {D6,250,0}, {Cs6,250,0}, //16

	//B17-21
	{E5,250,250}, {B5,250,250}, {As5,250,250}, {D6,250,250}, //17
	{Cs6,250,250}, {Gs5,250,250}, {G5,250,250}, {B5,250,250}, //18
	{As5,250,250}, {E5,250,250}, {Ds5,250,250}, {A5,250,250}, //19
	{Gs5,250,250}, {E5,250,250}, {Fs5,250,250}, {Ds5,250,250}, //20
	{E5,250,250}, {B5,250,250}, {As5,250,250}, {D6,250,250}, //21

	//2nd page
	//B22-26
	{Cs6,250,250}, {Gs5,250,250}, {G5,250,250}, {B5,250,250}, //22
	{As5,250,250}, {E5,250,250}, {Ds5,250,250}, {A5,250,250}, //23
	{Gs5,250,250}, {E5,250,250}, {Fs5,250,250}, {Ds5,250,250}, //24
	{E5,250,250}, {B5,250,250}, {As5,250,250}, {D6,250,250}, //25
	{Cs6,250,250}, {Gs5,250,250}, {G5,250,250}, {B5,250,250}, //26

	//B27-30
	{As5,250,250}, {E5,250,250}, {Ds5,250,250}, {A5,250,250}, //27
	{Gs5,250,250}, {E5,250,250}, {Fs5,250,250}, {Ds5,250,250}, //28
	{E4,500,0}, {B4,500,0}, {As4,500,0}, {D5,500,0}, //29
	{Cs5,500,0}, {Gs4,500,0}, {G4,500,0}, {B4,500,0}, //30

	//B31-34
	{As4,500,0}, {E4,500,0}, {Ds4,500,0}, {A4,500,0}, //31
	{Gs4,500,0}, {E4,500,0}, {Fs4,500,0}, {Ds4,500,0}, //32
	{E5,250,250}, {E5,250,250}, {E5,250,250}, {E5,250,250},//33
	{As5,250,250}, {As5,250,250}, {As5,250,250}, {As5,250,250}, //34

	//B35-38
	{E5,250,250}, {E5,250,250}, {E5,250,250}, {E5,250,250}, //35
	{Cs6,250,250}, {Cs6,250,250}, {Cs6,250,250}, {Cs6,250,250}, //36
	{B4,250,250}, {B4,250,250}, {B4,250,250}, {B4,250,250}, //37
	{Fs5,250,250}, {Fs5,250,250}, {Fs5,250,250}, {Fs5,250,250}, //38

	//B39-42
	{G3,250,0}, {As3,250,250}, {G3,250,0}, {Cs4,250,250}, {G3,250,0}, {As3,250,10}, //39
	{As3,250,0}, {G3,250,0}, {Cs4,250,250}, {G3,250,0}, {A3,250,250}, {Fs3,250,0}, //40
	{E4,250,0}, {G4,250,0}, {E4,250,0}, {Ds4,250,0}, {E4,250,10}, {E4,250,0}, {E6,250,250}, //41
	{Ds6,250,250}, {D6,250,250}, {Cs6,250,0}, {C6,250,0}, {E5,250,0}, {G5,250,0}, //42

	//B43-47
	{As4,250,0}, {Cs4,250,0}, {As4,250,0}, {A4,250,0}, {As4,250,0}, {G4,250,0}, {G6,250,250}, //43
	{Fs6,250,250}, {F6,250,250}, {E6,250,0}, {Ds6,250,0}, {D6,250,0}, {Cs6,250,0}, //44
	{E4,250,500}, {E3,250,250}, {E3,250,0}, {Fs4,500,0}, //45
	{E4,250,500}, {E3,250,250}, {E3,250,0}, {Fs4,500,0}, //46
	{E4,250,500}, {E3,250,250}, {E3,250,0}, {Fs4,500,0}, //47

	//3rd page
	//B48
	{E4,250,500,}, {E3,250,1000}
};
// Sound effect for picking up an item (Pokemon)
static const note item[] = { 
	{A5,306,136}, {A5,153,10}, {A5,153,10}, {A5,153,0}, {B5,306,10}, {B5,306,10}, {B5,306,0}, {A5,1224,10},
};


// Sound effect for encountering baddies (Wild Pokemon Encounter)
static const note encounter[] = { 
	//Mid B1-2
	{A5,90,0}, {Gs5,90,0}, {G5,90,0}, {Fs5,90,0}, {A5,90,0}, {F5,90,0}, {Fs5,90,0}, {F5,90,0}, //1
	{A5,90,0}, {E5,90,0}, {F5,90,0}, {E5,90,0}, {A5,90,0}, {Ds5,90,0}, {E5,90,0}, {Ds5,90,0}, //1.5
	{A5,90,0}, {D5,90,0}, {Ds5,90,0}, {D5,90,0}, {A5,90,0}, {Cs5,90,0}, {D5,90,0}, {C5,90,0}, //2
	{A5,90,0}, {C5,90,0}, {Cs5,90,0}, {C5,90,0}, {A5,90,0}, {B4,90,0}, {C5,90,0}, {B4,90,0} //2.5
};



// Generic sound effect (Pokemon A button)
static const note aButton[] = { 
	{B5,77,0}, {E6,77,0}
};

// Sound effect for picking up a weapon (Level up Pokemon)
static const note weapon[] = {
	{E5,231,10},{E5,231,10}, {E5,231,0}, {B5,693,10}
};

// Sound effect for dying (Originally composed)
static const note lost[] = {
	{C4,77,0}, {D4,77,0}, {B3,77,0}, {A3,77,0}, {G3,77,0},{F3,77,0}, {E3,77,0}, {D3,77,0}, {C3,77,0}, {B2,77,0}
};

// Sound effect for winning (Victory Fanfare FFVII)
static const note won[] = {
	{C5,231,10}, {C5,231,10}, {C5,231,10}, {C5,462,0},
	{Gs4,462,0}, {As4,462,0}, {C5,462,0}, {As4,231,0}, {C5,924,0},
};
/*END OF MUSIC ARRAYS*/

/*START OF NOTE COUNT ARRAYS*/
#define NOTE_COUNT_startUp (sizeof(startUp)/sizeof(note))
#define NOTE_COUNT_rock (sizeof(rock)/sizeof(note))
#define NOTE_COUNT_baddies (sizeof(baddies)/sizeof(note))
#define NOTE_COUNT_cave (sizeof(cave)/sizeof(note))
#define NOTE_COUNT_testNote (sizeof(testNote)/sizeof(note))
#define NOTE_COUNT_item (sizeof(item)/sizeof(note))
#define NOTE_COUNT_encounter (sizeof(encounter)/sizeof(note))
#define NOTE_COUNT_aButton (sizeof(aButton)/sizeof(note))
#define NOTE_COUNT_weapon (sizeof(weapon)/sizeof(note))
#define NOTE_COUNT_light (sizeof(light)/sizeof(note))
#define NOTE_COUNT_fire (sizeof(fire)/sizeof(note))
#define NOTE_COUNT_ice (sizeof(ice)/sizeof(note))
#define NOTE_COUNT_sword (sizeof(sword)/sizeof(note))
#define NOTE_COUNT_punch (sizeof(punch)/sizeof(note))
#define NOTE_COUNT_lost (sizeof(lost)/sizeof(note))
#define NOTE_COUNT_won (sizeof(won)/sizeof(note))
/*END OF NOTE COUNT ARRAYS*/

/* END OF MUSIC CONFIG */

__attribute__((noreturn)) void runGame(void)  
{
	// play this so that it won't beep 
	for (unsigned int i=0; i < NOTE_COUNT_testNote; i++)
	{
		playNote(&testNote[i]);
		GPIOA->ODR ^= 1; 
		GPIOA->ODR ^= 2;
	}
				
	char ch;
	randomize();
	eputs("MicroRealms on the STM32L031\r\n");	
	
	showHelp();		
	
	while(GameStarted == 0)
	{
		for (unsigned int i=0; i < NOTE_COUNT_startUp; i++)
		{
			playNote(&startUp[i]);
			GPIOA->ODR ^= 1; 
			GPIOA->ODR ^= 2;
		}
	
		showGameMessage("Press S to start a new game\r\n");
		ch = getUserInput();			
		
