Hyper-TH/STM32/realm.c
		if ( (ch == 'S') || (ch == 's') )
			GameStarted = 1;
		for (unsigned int i=0; i < NOTE_COUNT_aButton; i++)
		{
			playNote(&aButton[i]);
			GPIOA->ODR ^= 1; 
			GPIOA->ODR ^= 2;
		}
		
	}
	RCC->IOPENR |= (1 << 0); // enable GPIOA
	RCC->IOPENR |= (1 << 1); // enable GPIOB
	RCC->IOPENR |= (1 << 2); // enable GPIOC

	pinMode(GPIOA, 0,1); // Make GPIOA bit 0 an output
	pinMode(GPIOA, 1,1); // Make GPIOA bit 1 an output
	initRealm(&theRealm);	
	initPlayer(&thePlayer,&theRealm);
	showPlayer(&thePlayer);
	showRealm(&theRealm,&thePlayer);
	showGameMessage("Press H for help");
	
	while (1)
	{
		ch = getUserInput();
		ch = ch | 32; // enforce lower case
		
		//playTune(cave, NOTE_COUNT_cave, 1);
		/*
		for (unsigned int i=0; i < NOTE_COUNT_cave; i++)
		{
			playNote(&cave[i]);
		}
		*/
		
		switch (ch) 
		{
			case 'h' : 
			{
				for (unsigned int i=0; i < NOTE_COUNT_aButton; i++)
				{
					playNote(&aButton[i]);
					GPIOA->ODR ^= 1; 
					GPIOA->ODR ^= 2;
				}
				showHelp();
				
				break;
			} // end case h
			
			/* START OF DIRECTION INPUTS */
			case 'w' : 
			{
				showGameMessage("North");
				step('n',&thePlayer,&theRealm);
				
				break;
			} // end case w
			case 's' : 
			{
				showGameMessage("South");
				step('s',&thePlayer,&theRealm);
				break;

			} // end case s
			case 'd' : 
			{
				showGameMessage("East");
				step('e',&thePlayer,&theRealm);
				break;
			} // end case d
			
			case 'a' : 
			{
				showGameMessage("West");
				step('w',&thePlayer,&theRealm);
				break;
			} // end case a
			/* END OF DIRECTION INPUTS */
			
			// map
			case '#' : 
			{		
				for (unsigned int i=0; i < NOTE_COUNT_aButton; i++)
				{
					playNote(&aButton[i]);
					GPIOA->ODR ^= 1; 
					GPIOA->ODR ^= 2;
				}
				showRealm(&theRealm,&thePlayer);
				
				break;
			} // end case #
			
			case 'p' : 
			{		
				for (unsigned int i=0; i < NOTE_COUNT_aButton; i++)
				{
				playNote(&aButton[i]);
				GPIOA->ODR ^= 1; 
				GPIOA->ODR ^= 2;
				}
				showPlayer(&thePlayer);
				
				break;
			} // end case p
			
		} // end switch
		
	} // end while
	
} // end runGame

void step(char Direction,tPlayer *Player,tRealm *Realm)
{
	uint8_t new_x, new_y;
	new_x = Player->x;
	new_y = Player->y;
	byte AreaContents;
	
	// switch case for changing player position
	switch (Direction) 
	{
		case 'n' :
		{
			if (new_y > 0)
				new_y--;
			break;
		}
		case 's' :
		{
			if (new_y < MAP_HEIGHT-1)
				new_y++;
			break;
		}
		case 'e' :
		{
			if (new_x <  MAP_WIDTH-1)
				new_x++;
			break;
		}
		case 'w' :
		{
			if (new_x > 0)
				new_x--;
			break;
		}		
		
	} // end switch
	
	AreaContents = Realm->map[new_y][new_x];
	
	if ( AreaContents == '*')
	{
		for (unsigned int i=0; i < NOTE_COUNT_rock; i++)
		{
			playNote(&rock[i]);
			GPIOA->ODR ^= 1; 
			GPIOA->ODR ^= 2;
		}
	
		showGameMessage("A rock blocks your path.");
		return;
	}
	
	Player->x = new_x;
	Player->y = new_y;
	int Consumed = 0;
	
	switch (AreaContents)
	{
		/* START OF BADDIES */
		// const char Baddies[]={'O','T','B','H'};
		case 'O' :
		{
			for (unsigned int i=0; i < NOTE_COUNT_encounter; i++)
			{
				playNote(&encounter[i]);
				GPIOA->ODR ^= 1; 
				GPIOA->ODR ^= 2;
			}
			
			showGameMessage("A smelly green Ogre appears before you");
			Consumed = doChallenge(Player,0);
			
			break;
		} // end case o
		
		case 'T' :
		{
			for (unsigned int i=0; i < NOTE_COUNT_encounter; i++)
			{
				playNote(&encounter[i]);
				GPIOA->ODR ^= 1; 
				GPIOA->ODR ^= 2;
			}
			
			showGameMessage("An evil troll challenges you");
			Consumed = doChallenge(Player,1);
			
			break;
		} // end case t
		
		case 'D' :
		{
			for (unsigned int i=0; i < NOTE_COUNT_encounter; i++)
			{
				playNote(&encounter[i]);
				GPIOA->ODR ^= 1; 
				GPIOA->ODR ^= 2;
			}
			
			showGameMessage("A smouldering Dragon blocks your way !");
			Consumed = doChallenge(Player,2);
			
			break;
		} // end case d
		
		case 'H' :
		{
			for (unsigned int i=0; i < NOTE_COUNT_encounter; i++)
			{
				playNote(&encounter[i]);
				GPIOA->ODR ^= 1; 
				GPIOA->ODR ^= 2;
			}

			showGameMessage("A withered hag cackles at you wickedly");
			Consumed = doChallenge(Player,3);
			
			break;
		} // end case H
		/* END BADDIES */
		
		/* START OF ITEMS */
		case 'h' :
		{
			GPIOA->ODR |= (1 << 1); // turn led on
			
			for (unsigned int i=0; i < NOTE_COUNT_item; i++)
			{
				playNote(&item[i]);
			}
			
			showGameMessage("You find an elixir of health");
			setHealth(Player,Player->health+10);
			Consumed = 1;		
			
			delay(100000); // wait
			GPIOA->ODR &= ~(1u << 1); // turn led off
			
			break;
		} // end h
		
		case 's' :
		{
			GPIOA->ODR |= (1 << 1); // turn led on
			
			for (unsigned int i=0; i < NOTE_COUNT_item; i++)
			{
				playNote(&item[i]);
			}
			
			showGameMessage("You find a potion of strength");
			Consumed = 1;
			setStrength(Player,Player->strength+1);
			
			delay(100000); // wait
			GPIOA->ODR &= ~(1u << 1); // turn led off
			
			break;
		} // end case s
		
		case 'g' :
		{
			GPIOA->ODR |= (1 << 1); // turn led on
			
			for (unsigned int i=0; i < NOTE_COUNT_item; i++)
			{
				playNote(&item[i]);
			}
	
			showGameMessage("You find a shiny golden nugget");
			Player->wealth++;			
			Consumed = 1;
			
			delay(100000); // wait
			GPIOA->ODR &= ~(1u << 1); // turn led off
			
			break;
		} // end case g
		
		case 'm' :
		{
			GPIOA->ODR |= (1 << 1); // turn led on
			
			for (unsigned int i=0; i < NOTE_COUNT_item; i++)
			{
				playNote(&item[i]);
			}

			showGameMessage("You find a magic charm");
			Player->magic++;						
			Consumed = 1;
			
			delay(100000); // wait
			GPIOA->ODR &= ~(1u << 1); // turn led off
			
			break;
		} // end case m
		
		/* END OF ITEMS */
		case 'w' :
		{
			Consumed = addWeapon(Player,(int)random(MAX_WEAPONS-1)+1);
			showPlayer(Player);
			break;			
		} // end case w
		
		case 'X' : 
		{
			// Player landed on the exit
			eputs("A door! You exit into a new realm");
			setHealth(Player,100); // maximize health
			initRealm(&theRealm);
			showRealm(&theRealm,Player);
		} // end case X
	} // end switch
	if (Consumed)
		Realm->map[new_y][new_x] = '.'; // remove any item that was found
} // end voidstep()


int doChallenge(tPlayer *Player,int BadGuyIndex)
{
	char ch;
	char Damage;
	const byte *dmg;
	int BadGuyHealth = 100;
	
	eputs("Press F to fight");
	ch = getUserInput() | 32; // get user input and force lower case
	
	// player choses to fight
	if (ch == 'f')
	{
		playTune(cave, NOTE_COUNT_cave, 1);
		
		for (unsigned int i=0; i < NOTE_COUNT_baddies; i++)
		{
			playNote(&baddies[i]);
		}
		
		eputs("\r\nChoose action");
		
		while ( (Player->health > 0) && (BadGuyHealth > 0) )
		{
			eputs("\r\n");
			
			// Player takes turn first
			if (Player->magic > ICE_SPELL_COST)
				eputs("(I)CE spell");
			if (Player->magic > FIRE_SPELL_COST)
				eputs("(F)ire spell");
			if (Player->magic > LIGHTNING_SPELL_COST)
				eputs("(L)ightning spell");
			
			if (Player->Weapon1)
			{
				eputs("(1)Use ");
				eputs(getWeaponName(Player->Weapon1));
			}	
			
			if (Player->Weapon2)
			{
				eputs("(2)Use ");
				eputs(getWeaponName(Player->Weapon2));
			}
			
