Hyper-TH/STM32/realm.c
			eputs("(P)unch");
			ch = getUserInput();
			
			switch (ch)
			{
				
				case 'i':
				case 'I':
				{
					for (unsigned int i=0; i < NOTE_COUNT_ice; i++)
					{
						playNote(&ice[i]);
						GPIOA->ODR ^= 1; 
						GPIOA->ODR ^= 2;
					}
					
					eputs("FREEZE!");
					Player->magic -= ICE_SPELL_COST;
					BadGuyHealth -= FreezeSpellDamage[BadGuyIndex]+random(10);
					zap();
					
					break;
				}
				
				case 'f':
				case 'F':
				{
					for (unsigned int i=0; i < NOTE_COUNT_fire; i++)
					{
						playNote(&fire[i]);
						GPIOA->ODR ^= 1; 
						GPIOA->ODR ^= 2;
					}
					
					eputs("BURN!");
					Player->magic -= FIRE_SPELL_COST;
					BadGuyHealth -= FireSpellDamage[BadGuyIndex]+random(10);
					zap();
					break;
				}
				
				case 'l':
				case 'L':
				{
					for (unsigned int i=0; i < NOTE_COUNT_light; i++)
					{
						playNote(&light[i]);
						GPIOA->ODR ^= 1; 
						GPIOA->ODR ^= 2;
					}
					
					eputs("ZAP!");
					Player->magic -= LIGHTNING_SPELL_COST;
					BadGuyHealth -= LightningSpellDamage[BadGuyIndex]+random(10);
					zap();
					
					break;
				}
				
				case '1':
				{
					for (unsigned int i=0; i < NOTE_COUNT_sword; i++)
					{
						playNote(&sword[i]);
						GPIOA->ODR ^= 1; 
						GPIOA->ODR ^= 2;
					}
					
					dmg = WeaponDamage+(Player->Weapon1<<2)+BadGuyIndex;
					eputs("Take that!");
					BadGuyHealth -= *dmg + random(Player->strength);
					setStrength(Player,Player->strength-1);
					
					break;
				}
				
				case '2':
				{
					for (unsigned int i=0; i < NOTE_COUNT_sword; i++)
					{
						playNote(&sword[i]);
						GPIOA->ODR ^= 1; 
						GPIOA->ODR ^= 2;
					}
					
					dmg = WeaponDamage+(Player->Weapon2<<2)+BadGuyIndex;
					eputs("Take that!");
					BadGuyHealth -= *dmg + random(Player->strength);
					setStrength(Player,Player->strength-1);
					
					break;
				} 
				
				case 'p':
				case 'P':
				{
					for (unsigned int i=0; i < NOTE_COUNT_punch; i++)
					{
						playNote(&punch[i]);
						GPIOA->ODR ^= 1; 
						GPIOA->ODR ^= 2;
					}
					
					eputs("Thump!");
					BadGuyHealth -= 1+random(Player->strength);
					setStrength(Player,Player->strength-1);
					break;
				}
				
				default: 
				{	
					eputs("You fumble. Uh oh");
				}
				
			} // end switch
			
			// Bad guy then gets a go 
			
			if (BadGuyHealth < 0)
				BadGuyHealth = 0;
			Damage = (uint8_t)(BadGuyDamage[BadGuyIndex]+(int)random(5));
			setHealth(Player,Player->health - Damage);
			eputs("Health: you "); printDecimal(Player->health);
			eputs(", them " );printDecimal((uint32_t)BadGuyHealth);
			eputs("\r\n");
			
		} // end while
		
		if (Player->health == 0)
		{ // You died
			playTune(0,0,0);
			
			for (unsigned int i=0; i < NOTE_COUNT_lost; i++)
			{
					playNote(&lost[i]);
					GPIOA->ODR ^= 1; 
					GPIOA->ODR ^= 2;
			}
				
			eputs("You are dead. Press Reset to restart");
			while(1);
			
		} // end if
		
		else
		{ // You won!
			playTune(0,0,0);
			for (unsigned int i=0; i < NOTE_COUNT_won; i++)
			{
					playNote(&won[i]);
					GPIOA->ODR ^= 1; 
					GPIOA->ODR ^= 2;
			}
			
			playTune(cave, NOTE_COUNT_cave, 1);
			for (unsigned int i=0; i < NOTE_COUNT_cave; i++)
			{
					playNote(&cave[i]);
			}
			
			Player->wealth = (uint8_t)(50 + random(50));			
			showGameMessage("You win! Their gold is yours");			
			
			return 1;
		} // end else
		
	} // end outer if
	
	else
	{
		showGameMessage("Our 'hero' chickens out");
		
		return 0;
	} // end else

} // end doChallenge()

int addWeapon(tPlayer *Player, int Weapon)
{
	char c;
	eputs("You stumble upon ");
	
	for (unsigned int i=0; i < NOTE_COUNT_weapon; i++)
	{
		playNote(&weapon[i]);
		GPIOA->ODR ^= 1; 
		GPIOA->ODR ^= 2;
	}
				
	switch (Weapon)
	{
		case 1:
		{	
			eputs("a mighty axe");
			break;
		}
		case 2:
		{	
			eputs("a sword with mystical runes");
			break;
		}
		case 3:
		{	
			eputs("a bloody flail");
			break;
		}		
		default:
			printDecimal((uint32_t)Weapon);
	}
	if ( (Player->Weapon1) && (Player->Weapon2) )
	{
		// The player has two weapons already.
		showPlayer(Player);
		eputs("You already have two weapons\r\n");		
		eputs("(1) drop Weapon1, (2) for Weapon2, (0) skip");
		c = getUserInput();
		eputchar(c);
		switch(c)
		{
			case '0':{
				return 0; // don't pick up
			}
			case '1':{
				Player->Weapon1 = (uint8_t)Weapon;
				break;
			}
			case '2':{
				Player->Weapon2 = (uint8_t)Weapon;
				break;
			}
		}
	}
	else
	{
		if (!Player->Weapon1)
		{
			Player->Weapon1 = (uint8_t)Weapon;	
		}
		else if (!Player->Weapon2)
		{
			Player->Weapon2 = (uint8_t)Weapon;
		}
	}	
	return 1;
} // end addWeapon

const char *getWeaponName(int index)
{
	switch (index)
	{
		case 0:return "Empty"; 
		case 1:return "Axe";
		case 2:return "Sword"; 
		case 3:return "Flail"; 
	}
	return "Unknown";
} // end getWeaponName
void setHealth(tPlayer *Player,int health)
{
	if (health > 100)
		health = 100;
	if (health < 0)
		health = 0;
	Player->health = (uint8_t)health;
} // end setHealth	

void setStrength(tPlayer *Player, byte strength)
{
	if (strength > 100)
		strength = 100;
	Player->strength = strength;
} // end setStrength

void initPlayer(tPlayer *Player,tRealm *Realm)
{
	// get the player name
	int index=0;
	byte x,y;
	char ch=0;
	// Initialize the player's attributes
	eputs("Enter the player's name: ");
	while ( (index < MAX_NAME_LEN) && (ch != '\n') && (ch != '\r'))
	{
		ch = getUserInput();
		if ( ch > '0' ) // strip conrol characters
		{
			
			Player->name[index++]=ch;
			eputchar(ch);
		}
	}
	Player->name[index]=0; // terminate the name
	setHealth(Player,100);
	Player->strength=(uint8_t)(50+random(50));
	Player->magic=(uint8_t)(50+random(50));	
	Player->wealth=(uint8_t)(10+random(10));
	Player->Weapon1 = 0;
	Player->Weapon2 = 0;
	// Initialize the player's location
	// Make sure the player does not land
	// on an occupied space to begin with
	do {
		x=(uint8_t)random(MAP_WIDTH);
		y=(uint8_t)random(MAP_HEIGHT);
		
	} while(Realm->map[y][x] != '.');
	Player->x=x;
	Player->y=y;
	
	for (unsigned int i=0; i < NOTE_COUNT_aButton; i++)
	{
		playNote(&aButton[i]);
		GPIOA->ODR ^= 1; 
		GPIOA->ODR ^= 2;
	}
				
}// end initPlayer

