Hyper-TH/STM32/realm.c
void showPlayer(tPlayer *Player)
{
	eputs("\r\nName: ");
	eputs(Player->name);
	eputs("health: ");
	printDecimal(Player->health);
	eputs("\r\nstrength: ");
	printDecimal(Player->strength);
	eputs("\r\nmagic: ");
	printDecimal(Player->magic);
	eputs("\r\nwealth: ");
	printDecimal(Player->wealth);	
	eputs("\r\nLocation : ");
	printDecimal(Player->x);
	eputs(" , ");
	printDecimal(Player->y);	
	eputs("\r\nWeapon1 : ");
	eputs(getWeaponName(Player->Weapon1));
	eputs(" Weapon2 : ");
	eputs(getWeaponName(Player->Weapon2));
} // end showPlayer

void initRealm(tRealm *Realm)
{
	unsigned int x,y;
	unsigned int Rnd;
	// clear the map to begin with
	for (y=0;y < MAP_HEIGHT; y++)
	{
		for (x=0; x < MAP_WIDTH; x++)
		{
			Rnd = random(100);
			
			if (Rnd >= 98) // put in some baddies
				Realm->map[y][x]=	Baddies[random(sizeof(Baddies))];
			else if (Rnd >= 95) // put in some good stuff
				Realm->map[y][x]=	FindTypes[random(sizeof(FindTypes))];
			else if (Rnd >= 90) // put in some rocks
				Realm->map[y][x]='*'; 
			else // put in empty space
				Realm->map[y][x] = '.';	
		}
	}
	
	// finally put the exit to the next level in
	x = random(MAP_WIDTH);
	y = random(MAP_HEIGHT);
	Realm->map[y][x]='X';
}	// end initRealm

void showRealm(tRealm *Realm,tPlayer *Player)
{
	int x,y;
	eputs("\r\nThe Realm:\r\n");	
	for (y=0;y<MAP_HEIGHT;y++)
	{
		for (x=0;x<MAP_WIDTH;x++)
		{
			
			if ( (x==Player->x) && (y==Player->y))
				eputchar('@');
			else
				eputchar(Realm->map[y][x]);
		}
		eputs("\r\n");
	}
	eputs("\r\nLegend\r\n");
	eputs("(T)roll, (O)gre, (D)ragon, (H)ag, e(X)it\r\n");
	eputs("(w)eapon, (g)old), (m)agic, (s)trength\r\n");
	eputs("@=You\r\n");
} // end showRealm

void showHelp()
{

	eputs("Help\r\n");
	eputs("N,S,E,W : go North, South, East, West\r\n");
	eputs("# : show map (cost: 1 gold piece)\r\n");
	eputs("(H)elp\r\n");
	eputs("(P)layer details\r\n");
	
} // end showHelp

void showGameMessage(char *Msg)
{
	eputs(Msg);
	eputs("\r\nReady\r\n");	
} // end showGameMessage

char getUserInput()
{
	char ch = 0;
	
	while (ch == 0)
		ch = egetchar();
	return ch;
} // end getUserInput

unsigned random(unsigned range)
{
	// Implementing my own version of modulus
	// as it is a lot smaller than the library version
	// To prevent very long subtract loops, the
	// size of the value returned from prbs has been
	// restricted to 8 bits.
	unsigned Rvalue = (prbs()&0xff);
	while (Rvalue >= range)
		Rvalue -= range; 
	return Rvalue;
} // end unsigned random

void zap()
{

} // end zap

void ADCBegin()
{
	RCC->APB2ENR |= (1u << 9); // Turn on ADC
	RCC->IOPENR |= 1; // enable GPIOA
	pinMode(GPIOA,4,3); // Make GPIOA_4 an analogue input
	ADC1->CR = 0; // disable ADC before making changes
	ADC1->CR |= (1u << 28); // turn on the voltage regulator
	ADC1->CR |= (1u << 31); // start calibration
	while ( (ADC1->CR & (1u << 31)) != 0); // Wait for calibration to complete.
	ADC1->CHSELR = (1 << 8); // select channel4  
	ADC1->CR |= 1; // enable the ADC
} // end ADCBegin

uint16_t ADCRead(void)
{
	ADC1->CR |= (1 << 2); // start a conversion
	while ( (ADC1->CR & (1 << 2)) != 0); // Wait for conversion to complete.
	return (uint16_t)ADC1->DR;
} // end ADCRead

static unsigned long shift_register=0;

void randomize()
{
	// To generate a "true" random seed for the prbs generator
	// Repeatedly read a floating analogue input (32 times)
	// and the least significant bit of that read to set each
	// bit of the prbs shift registers.
	// Must make sure that all of its buts are not zero when
	// done.
	RCC->IOPENR |= (1 << 1); // enable port B
	pinMode(GPIOB,0,3); // use PB0 as the source of noise.  This ADC channel 8
	ADCBegin();
	shift_register = 0;
	while(shift_register == 0)
	{
		for (int i=0; i < 32; i++)
		{
			shift_register = shift_register << 1;
			shift_register |= (ADCRead() & 1);
			delay(10000);
			printDecimal(shift_register);
			eputs("\r\n");
		}
	}
} // end randomize

uint32_t prbs()
{
	// This is an unverified 31 bit PRBS generator
	// It should be maximum length but this has not been verified

	unsigned long new_bit=0;

			new_bit = (shift_register >> 27) ^ (shift_register >> 30);
			new_bit = new_bit & 1;
			shift_register=shift_register << 1;
			shift_register=shift_register | (new_bit);

	return shift_register & 0x7fffffff; // return 31 LSB's
} // end prbs


void playTune(const note *n, int notecount, int repeat)
{
	TuneLoop = repeat;
	Tune = n;
	TuneNoteCount = notecount;
}

void playNote(note *n)
{
	uint32_t Period = 1000000 / n->frequency;
	TIM2->CR1 |= 1; // enable counter 
	TIM2->ARR = Period; // Set initial reload value of 1000 microseconds
	TIM2->CCR2 = TIM2->ARR/2; // 50% duty;
	SoundDuration = n->duration;
	while(SoundDuration != 0); // Wait
	TIM2->ARR = 1;
	TIM2->CR1 |= 0; // enable counter 
	delayms(n->wait);

} // end playNote

/* OLD SYSTICK_HANDLER
void SysTick_Handler(void)
{
	
	if (SoundDuration > 0)
	{
		SoundDuration --;
	}
	ms_counter ++;   // another millisecond has passed

} // end sysTick_Handler
*/

/* NEW SYSTICK HANDLER */
void SysTick_Handler(void)
{
	static int CurrentNote = 0;
	
	// if sound duration > 0
	if (SoundDuration > 0)
	{
		// decrement it
		SoundDuration --;
	}
	
	// if sound duration has reached 0
	else
	{
		
		CurrentNote++;
		
		// check if current note is NOT the last note of the array
		if (CurrentNote < TuneNoteCount)
		{
			// play tune at that current note
			playNote(&Tune[CurrentNote]);
		}

		// if end of tune array
		else
		{
			// is tune meant to loop?
			if (TuneLoop)
			{
				// reset back to the note	
				CurrentNote = 0;
			}
			else
			{
				// stop the sound
				stopSound();
			}
		}
	}

	ms_counter ++; // another millisecond has passed
} // end systick()

void stopSound()
{
	TIM2->CR1 = 0; // disable counter
}

void delayms(uint32_t dly)
{
	dly = dly+ms_counter;
	while(ms_counter < dly);
} // end delayMs
